## 1. ACCESSING DATA

In [15]:
import pandas as pd
import numpy as np
import re
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.impute import KNNImputer



#pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [5]:
df = pd.read_csv('hr_raw_data_v1.csv')

In [7]:
df.head(1)

,employee_number,gender,birth_year,age,marital_status,dist_home,job_title,department,terminated,year_at_comp,year_current_role,standard_hours,remote,business_travel,over_time,job_level,stock_opt_level,traning_times_last_year,perf_rate,year_last_promotion,year_current_mngr,education_field,education_scale,annual_salary,monthly_income,daily_rate,hourly_rate,monthly_rate,perc_salary_hike,env_sat_rate,job_involvement,job_sat_rate,relationship_sat_rate,work_life_balance,num_comp_worked,tot_working_year
0,1,0,1972,51,NaN,6,resEArch DIREcToR,NaN,No,20,NaN,Full Time,Yes,NaN,No,5,0,5,"3,0",15,15,NaN,3,"195370,00$","16280,83$",2015.722222,NaN,"42330,17$",13,1,3,3,3,"3,0",7,NaN

## 2. DATA CLEANING

In [12]:
# Values format to title and strip

to_title = ['marital_status', 'job_title',  'department', 'education_field']

df[to_title] = df[to_title].apply(lambda x: x.str.title().str.strip() if x.dtype == 'object' else x)

In [8]:
# Marital status typos fixing

df["marital_status"]=df["marital_status"].replace("Marreid", "Married")

In [13]:
# Converting obj to float

convert_float = ['annual_salary','monthly_income','daily_rate']
def replace_currency(value):
        try:
                value = float(value.replace("$", "").replace(",", "."))
                return value
        except:
            return value



for col in convert_float:
     df[col]=df[col].apply(replace_currency)

In [10]:
# Replacing values obj to numeric in age

age_update = {
    'thirty-two': 32,
    'twenty-four': 24,
    'thirty': 30,
    'fifty-eight': 58,
    'fifty-two': 52,
    'twenty-six': 26,
    'fifty-five': 55,
    'thirty-seven': 37,
    'thirty-six': 36,
    'forty-seven': 47,
    'thirty-one': 31}

df['age'] = df['age'].replace(age_update)

In [ ]:
# Gender update, where 0 is male and 1 is female
#gender_map = {0: "M", 1:"F"}
#df['gender'] = df['gender'].map(gender_map)

## 3. NULLS MANAGEMENT

In [20]:
# RELATED SALARY COLUMNS IMPUTATION

salary_base =['monthly_income', 'daily_rate', 'annual_salary']

imputer = KNNImputer(n_neighbors=3)
df[salary_base] = imputer.fit_transform(df[salary_base])

In [19]:
# CONFIRMATION: RELATED SALARY COLUMNS IMPUTATION 
df[salary_base].isnull().sum()

monthly_income    0
daily_rate        0
annual_salary     0
dtype: int64

In [ ]:
departments_dict =  {"Research & Development": ["Healthcare Representative", "Laboratory Technician", "Manufacturing Director", "Research Scientist", "Research Director"],
                    "Sales": ["Sales Executive", "Sales Representative"],
                    "Human Resources": ["Human Resources"]}

df['department'] = df['department'].fillna(df['job_title'].map(departments_dict))

In [ ]:
departments_dict = {
    "Research & Development": ["Healthcare Representative", "Laboratory Technician", "Manufacturing Director", "Research Scientist", "Research Director"],
    "Sales": ["Sales Executive", "Sales Representative"],
    "Human Resources": ["Human Resources"]
}

# Reverse the dictionary to map job titles to departments
job_to_department = {job: dept for dept, jobs in departments_dict.items() for job in jobs}


def map_department(job_title):
    try:
        return job_to_department[job_title]
    except:
        return None 

# Apply the function to fill missing department values
df['department'] = df['department'].fillna(df['job_title'].apply(map_department))

Updated DataFrame:
      employee_number  gender  birth_year age marital_status  dist_home  \
0                   1       0        1972  51            NaN          6
1                   2       0        1971  52            NaN          1
2                   3       0        1981  42        Married          4
3                   4       1        1976  47        Married          2
4                   5       1        1977  46       Divorced          3
...               ...     ...         ...  ..            ...        ...
1673              824       1        1980  43         Single        -26
1674             1087       1        1976  47        Married         26
1675              528       0        1994  29            NaN         15
1676               76       1        1976  47       Divorced          4
1677              401       1        1991  32         Single          2

                   job_title              department terminated  year_at_comp  \
0          Research Director  Research & Development         No            20
1                    Manager                    None         No            33
2                    Manager  Research & Development         No            22
3          Research Director  Research & Development         No            20
4            Sales Executive                   Sales         No            19
...                      ...                     ...        ...           ...
1673      Research Scientist  Research & Development         No             3
1674                 Manager                    None         No             5
1675      Research Scientist  Research & Development         No             6
1676  Manufacturing Director  Research & Development         No            22
1677      Research Scientist  Research & Development         No             8

     year_current_role standard_hours remote business_travel over_time  \
0                  NaN      Full Time    Yes             NaN        No
1                  NaN            NaN      1             NaN       NaN
2                  NaN            NaN      1   travel_rarely        No
3                  NaN      Full Time  False   travel_rarely       NaN
4                  NaN            NaN      0             NaN        No
...                ...            ...    ...             ...       ...
1673               NaN            NaN    Yes             NaN       NaN
1674               NaN      Full Time  False             NaN        No
1675               NaN      Part Time  False   travel_rarely        No
1676               NaN      Part Time    Yes   travel_rarely       Yes
1677               NaN      Part Time      0             NaN       Yes

      job_level  stock_opt_level  traning_times_last_year perf_rate  \
0             5                0                        5       3,0
1             5                1                        5       3,0
2             5                0                        3       3,0
3             4                2                        2       3,0
4             4                1                        5       3,0
...         ...              ...                      ...       ...
1673          1                0                        2       3,0
1674          5                1                        2       3,0
1675          1                0                        1       3,0
1676          3                1                        4       NaN
1677          2                0                        2       3,0

      year_last_promotion  year_current_mngr   education_field  \
0                      15                 15               NaN
1                      11                  9     Life Sciences
2                      11                 15  Technical Degree
3                       5                  6           Medical
4                       2                  8  Technical Degree
...                   ...                ...               ...
1673                    1                  2           Medical
1674                    1                  0               NaN
1675                    1                  5               NaN
1676                   14                 10     Life Sciences
1677                    0                  7     Life Sciences

      education_scale  annual_salary  monthly_income   daily_rate  \
0                   3  195370.000000    16280.830000  2015.722222
1                   4  199990.000000    16125.406667  2063.388889
2                   2  192320.000000    15943.720000  1984.253968
3                   4  171690.000000    14307.500000  1771.404762
4                   3  153407.070000    12783.920000  1582.771346
...               ...            ...             ...          ...
1673                3   47456.666667     3949.170000   488.944444
1674                4  191324.620000    15943.720000  1973.984127
1675                3   28111.130000     2342.590000   290.035510
1676                3  100071.840000     8339.320000  1032.487286
1677                2   53914.110000     4492.840000   556.256661

      hourly_rate monthly_rate  perc_salary_hike  env_sat_rate  \
0             NaN    42330,17$                13             1
1             NaN    43331,17$                14             3
2             NaN    41669,33$                11             3
3             NaN    37199,50$                19             1
4             NaN    33238,20$                12             1
...           ...          ...               ...           ...
1673          NaN    10267,83$                12             2
1674          NaN    41453,67$                11             4
1675          NaN     6090,75$                19             3
1676          NaN    21682,23$                12             3
1677    69.532083    11681,39$                14             4

      job_involvement  job_sat_rate  relationship_sat_rate work_life_balance  \
0                   3             3                      3               3,0
1                   2             3                      1               3,0
2                   3             4                      4               NaN
3                   3             3                      2               NaN
4                   4             1                      4               3,0
...               ...           ...                    ...               ...
1673                4             3                      4               3,0
1674                3             3                      3               3,0
1675                3             4                      1               3,0
1676                2             2                      3               3,0
1677                3             3                      4               3,0

      num_comp_worked tot_working_year
0                   7              NaN
1                   0             34,0
2                   1             22,0
3                   3              NaN
4                   2              NaN
...               ...              ...
1673                4              NaN
1674                3             27,0
1675                1              6,0
1676                8              NaN
1677                4             10,0

[1678 rows x 36 columns]

Job Titles Without a Match:
['Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager', 'Manager']

In [28]:
df['department'].isna().sum()

95

## EXPORTING NEW DATA

In [ ]:
df.to_csv("hr_raw_data_v1.csv", index=False)